chadalvarez/ESP32FirmwareDL/src/ESP32FirmwareDownloader.cpp
#include "ESP32FirmwareDownloader.h"
#include <WiFi.h>
#include <SPI.h>
#include "esp_flash.h"       // esp_flash_read() and esp_flash_default_chip()
#include "esp_partition.h"   // Partition APIs
#include "esp_ota_ops.h"     // OTA update APIs
#include <esp_task_wdt.h>    // esp_task_wdt_reset()
#include <esp_err.h>

#ifndef ESP_IMAGE_HEADER_MAGIC
  #define ESP_IMAGE_HEADER_MAGIC 0xE9
#endif

// Fixed constants for bootloader download.
static const uint32_t BOOTLOADER_OFFSET = 0x1000;
static const uint32_t BOOTLOADER_SIZE   = 0x7000;
static const size_t   CHUNK_SIZE        = 4096;

// Global variables for streaming.
static uint32_t g_flashSizeDirect = 0;
static uint32_t g_genPartStart = 0;
static uint32_t g_genPartSize  = 0;

// Forward declarations for helper functions.
static bool isPartitionValid(const esp_partition_t* part);
static bool cloneActiveToInactive();

// Initialize static members.
ESP32FirmwareDownloader* ESP32FirmwareDownloader::_instance = nullptr;
ESP32FirmwareDownloader::BlankRegion ESP32FirmwareDownloader::_blankRegions[MAX_BLANK_REGIONS];
int ESP32FirmwareDownloader::_numBlankRegions = 0;

////////////////////
// Helper Functions
////////////////////

// Check if a partition appears valid by reading its first byte.
static bool isPartitionValid(const esp_partition_t* part) {
  uint8_t magic;
  esp_err_t err = esp_flash_read(esp_flash_default_chip, &magic, part->address, 1);
  if (err != ESP_OK) {
    Serial.printf("[isPartitionValid] Error reading flash at 0x%08X, error: %d\n", part->address, err);
    return false;
  }
  return (magic == ESP_IMAGE_HEADER_MAGIC);
}

// Clone the active APP partition to the inactive APP partition.
static bool cloneActiveToInactive() {
  const esp_partition_t *running = esp_ota_get_running_partition();
  if (!running) {
    Serial.println("Failed to get running partition!");
    return false;
  }
  esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, NULL);
  const esp_partition_t *inactive = nullptr;
  while (it != NULL) {
    const esp_partition_t *p = esp_partition_get(it);
    if (p && (p->address != running->address)) {
      inactive = p;
      break;
    }
    it = esp_partition_next(it);
  }
  if (!inactive) {
    Serial.println("Inactive partition not found!");
    return false;
  }
  
  uint8_t firstByte;
  if (esp_flash_read(esp_flash_default_chip, &firstByte, inactive->address, 1) != ESP_OK) {
    Serial.println("Error reading inactive partition!");
    return false;
  }
  if (firstByte != ESP_IMAGE_HEADER_MAGIC) {
    Serial.println("Inactive partition appears empty; proceeding with clone.");
  } else {
    Serial.println("Inactive partition appears valid; cloning anyway.");
  }
  
  esp_ota_handle_t ota_handle;
  esp_err_t err = esp_ota_begin(inactive, running->size, &ota_handle);
  if (err != ESP_OK) {
    Serial.printf("esp_ota_begin failed (%s)!\n", esp_err_to_name(err));
    return false;
  }
  
  const size_t chunkSize = CHUNK_SIZE;
  uint8_t buffer[chunkSize];
  size_t bytesRead = 0;
  size_t totalSize = running->size;
  
  Serial.printf("Cloning %u bytes from 0x%08X to 0x%08X...\n", totalSize, running->address, inactive->address);
  
  while (bytesRead < totalSize) {
    size_t toRead = ((totalSize - bytesRead) < chunkSize) ? (totalSize - bytesRead) : chunkSize;
    err = esp_flash_read(esp_flash_default_chip, buffer, running->address + bytesRead, toRead);
    if (err != ESP_OK) {
      Serial.printf("esp_flash_read failed at offset %u (%s)!\n", bytesRead, esp_err_to_name(err));
      return false;
    }
    err = esp_ota_write(ota_handle, buffer, toRead);
    if (err != ESP_OK) {
      Serial.printf("esp_ota_write failed at offset %u (%s)!\n", bytesRead, esp_err_to_name(err));
      return false;
    }
    bytesRead += toRead;
    Serial.printf("Cloned %u/%u bytes...\n", bytesRead, totalSize);
    yield();
    esp_task_wdt_reset();
  }
  
  err = esp_ota_end(ota_handle);
  if (err != ESP_OK) {
    Serial.printf("esp_ota_end failed (%s)!\n", esp_err_to_name(err));
    return false;
  }
  
  err = esp_ota_set_boot_partition(inactive);
  if (err != ESP_OK) {
    Serial.printf("esp_ota_set_boot_partition failed (%s)!\n", esp_err_to_name(err));
    return false;
  }
  
  Serial.println("Clone complete; inactive partition activated.");
  return true;
}

//////////////////////////
// Streaming Callback Functions
//////////////////////////

size_t ESP32FirmwareDownloader::flashStreamCallback(uint8_t *buffer, size_t maxLen, size_t index) {
  if (index >= g_flashSizeDirect) return 0;
  size_t bytesToRead = ((g_flashSizeDirect - index) < maxLen) ? (g_flashSizeDirect - index) : maxLen;
  esp_err_t err = esp_flash_read(esp_flash_default_chip, buffer, index, bytesToRead);
  if (err != ESP_OK) {
    Serial.printf("[DirectStream] Error at 0x%08X: %s\n", index, esp_err_to_name(err));
    return 0;
  }
  static uint32_t lastPrinted = 0;
  if (index - lastPrinted >= CHUNK_SIZE * 10) {
    Serial.printf("[DirectStream] Streamed %u/%u bytes...\n", index + bytesToRead, g_flashSizeDirect);
    lastPrinted = index;
  }
  esp_task_wdt_reset();
  return bytesToRead;
}

size_t ESP32FirmwareDownloader::flashStreamCallbackBlanked(uint8_t *buffer, size_t maxLen, size_t index) {
  if (index >= g_flashSizeDirect) return 0;
  size_t bytesToRead = ((g_flashSizeDirect - index) < maxLen) ? (g_flashSizeDirect - index) : maxLen;
  // Limit bytes to CHUNK_SIZE.
  if (bytesToRead > CHUNK_SIZE) bytesToRead = CHUNK_SIZE;
  uint8_t tempBuffer[CHUNK_SIZE];
  esp_err_t err = esp_flash_read(esp_flash_default_chip, tempBuffer, index, bytesToRead);
  if (err != ESP_OK) {
    Serial.printf("[SecureStream] Error at 0x%08X: %s\n", index, esp_err_to_name(err));
    return 0;
  }
  // For each blank region, replace overlapping bytes with 0xFF.
  for (int i = 0; i < _numBlankRegions; i++) {
    uint32_t regionStart = _blankRegions[i].offset;
    uint32_t regionEnd = regionStart + _blankRegions[i].length;
    uint32_t chunkStart = index;
    uint32_t chunkEnd = index + bytesToRead;
    if (chunkEnd > regionStart && chunkStart < regionEnd) {
      uint32_t overlapStart = (chunkStart > regionStart) ? chunkStart : regionStart;
      uint32_t overlapEnd = (chunkEnd < regionEnd) ? chunkEnd : regionEnd;
      uint32_t startInBuffer = overlapStart - chunkStart;
      uint32_t overlapLen = overlapEnd - overlapStart;
      for (uint32_t j = 0; j < overlapLen; j++) {
        tempBuffer[startInBuffer + j] = 0xFF;
      }
      Serial.printf("[SecureStream] Applied blank region: %s (0x%08X - 0x%08X)\n",
                    _blankRegions[i].description, regionStart, regionEnd);
    }
  }
  memcpy(buffer, tempBuffer, bytesToRead);
  static uint32_t lastPrinted = 0;
  if (index - lastPrinted >= CHUNK_SIZE * 10) {
    Serial.printf("[SecureStream] Streamed %u/%u bytes...\n", index + bytesToRead, g_flashSizeDirect);
    lastPrinted = index;
  }
  esp_task_wdt_reset();
  return bytesToRead;
}

size_t ESP32FirmwareDownloader::genericPartStreamCallback(uint8_t *buffer, size_t maxLen, size_t index) {
  if (index >= g_genPartSize) return 0;
  size_t bytesToRead = ((g_genPartSize - index) < maxLen) ? (g_genPartSize - index) : maxLen;
  esp_err_t err = esp_flash_read(esp_flash_default_chip, buffer, g_genPartStart + index, bytesToRead);
  if (err != ESP_OK) {
    Serial.printf("[GenericStream] Error at 0x%08X: %s\n", g_genPartStart + index, esp_err_to_name(err));
    return 0;
  }
  static uint32_t lastPrinted = 0;
  if (index - lastPrinted >= CHUNK_SIZE * 10) {
    Serial.printf("[GenericStream] Streamed %u/%u bytes...\n", index + bytesToRead, g_genPartSize);
    lastPrinted = index;
  }
  esp_task_wdt_reset();
  return bytesToRead;
}

//////////////////////////////
// Blank Region Management
//////////////////////////////
void ESP32FirmwareDownloader::addBlankRegion(uint32_t offset, uint32_t length, const char* description) {
  if (_numBlankRegions < MAX_BLANK_REGIONS) {
    _blankRegions[_numBlankRegions].offset = offset;
    _blankRegions[_numBlankRegions].length = length;
    _blankRegions[_numBlankRegions].description = description;
    _numBlankRegions++;
    Serial.printf("[ESP32FirmwareDownloader] Added blank region: 0x%08X - 0x%08X (%s)\n", offset, offset+length, description);
  } else {
    Serial.println("[ESP32FirmwareDownloader] Maximum blank regions reached.");
  }
}

//////////////////////////
// Constructor and Setters
//////////////////////////
ESP32FirmwareDownloader::ESP32FirmwareDownloader(const char* endpoint, const String &filename)
  : _endpoint(endpoint),
    _firmwareFilename(filename),
    _blankOffset(0),
    _blankLength(0)
{
  _instance = this;
  _numBlankRegions = 0;
}

void ESP32FirmwareDownloader::setFilename(const String &filename) {
  _firmwareFilename = filename;
}

