chadalvarez/ESP32FirmwareDL/src/ESP32FirmwareDownloader.cpp
void ESP32FirmwareDownloader::setBlankRegion(uint32_t offset, uint32_t length) {
  _blankOffset = offset;
  _blankLength = length;
  _numBlankRegions = 0;
  addBlankRegion(offset, length, "manual");
}

bool ESP32FirmwareDownloader::autoSetUserDataBlank() {
  const esp_partition_t* userPart = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "userdata");
  if (userPart != NULL) {
    Serial.printf("[ESP32FirmwareDownloader] Found user data partition '%s' at 0x%08X, size: %u bytes\n",
                  userPart->label, userPart->address, userPart->size);
    _numBlankRegions = 0;
    addBlankRegion(userPart->address, userPart->size, "userdata");
    return true;
  }
  Serial.println("[ESP32FirmwareDownloader] No user data partition found with label 'userdata'.");
  return false;
}

bool ESP32FirmwareDownloader::autoSetUserDataBlankAll() {
  const char* labelsToBlank[] = {"nvs", "spiffs", "littlefs"};
  bool found = false;
  for (int i = 0; i < 3; i++) {
    const esp_partition_t* part = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, labelsToBlank[i]);
    if (part) {
      addBlankRegion(part->address, part->size, labelsToBlank[i]);
      found = true;
    }
  }
  if (!found) {
    Serial.println("[ESP32FirmwareDownloader] No NVS/Spiffs/LittleFS partitions found for blanking.");
  }
  return found;
}

////////////////////////////
// HTTP Handlers
////////////////////////////

void ESP32FirmwareDownloader::handleDumpFlash(AsyncWebServerRequest *request) {
  Serial.println("[ESP32FirmwareDownloader] Full flash dump request received.");
  uint32_t flashSize = ESP.getFlashChipSize();
  Serial.printf("[ESP32FirmwareDownloader] Flash size: %u bytes\n", flashSize);
  g_flashSizeDirect = flashSize;
  
  AsyncWebServerResponse *response = request->beginChunkedResponse("application/octet-stream", flashStreamCallback);
  response->addHeader("Content-Disposition", "attachment; filename=fullclone.bin");
  Serial.println("[ESP32FirmwareDownloader] Streaming full flash dump...");
  request->send(response);
}

void ESP32FirmwareDownloader::handleDumpFlashSecure(AsyncWebServerRequest *request) {
  Serial.println("[ESP32FirmwareDownloader] Secure full flash dump request received.");
  uint32_t flashSize = ESP.getFlashChipSize();
  Serial.printf("[ESP32FirmwareDownloader] Flash size: %u bytes\n", flashSize);
  g_flashSizeDirect = flashSize;
  
  AsyncWebServerResponse *response = request->beginChunkedResponse("application/octet-stream", flashStreamCallbackBlanked);
  response->addHeader("Content-Disposition", "attachment; filename=fullclone_secure.bin");
  Serial.println("[ESP32FirmwareDownloader] Streaming secure full flash dump...");
  request->send(response);
}

void ESP32FirmwareDownloader::handleDownloadPartitionDirect(AsyncWebServerRequest *request) {
  if (!request->hasParam("label")) {
    request->send(400, "text/plain", "Missing 'label' parameter");
    return;
  }
  String label = request->getParam("label")->value();
  Serial.printf("[ESP32FirmwareDownloader] Direct partition download for label: %s\n", label.c_str());
  
  const esp_partition_t* part = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, label.c_str());
  if (!part) {
    part = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, label.c_str());
  }
  if (!part) {
    request->send(404, "text/plain", "Partition not found");
    return;
  }
  Serial.printf("[ESP32FirmwareDownloader] Partition %s found, size %u bytes\n", part->label, part->size);
  
  g_genPartStart = part->address;
  g_genPartSize  = part->size;
  
  AsyncWebServerResponse* response = request->beginChunkedResponse("application/octet-stream", genericPartStreamCallback);
  response->addHeader("Content-Disposition", "attachment; filename=" + label + ".bin");
  Serial.println("[ESP32FirmwareDownloader] Streaming generic partition...");
  request->send(response);
}

void ESP32FirmwareDownloader::handleDownloadBoot(AsyncWebServerRequest *request) {
  Serial.println("[ESP32FirmwareDownloader] Bootloader download request received.");
  AsyncWebServerResponse* response = request->beginChunkedResponse("application/octet-stream",
    [](uint8_t *buffer, size_t maxLen, size_t index) -> size_t {
      if (index >= BOOTLOADER_SIZE) return 0;
      size_t toRead = ((BOOTLOADER_SIZE - index) < maxLen) ? (BOOTLOADER_SIZE - index) : maxLen;
      esp_err_t err = esp_flash_read(esp_flash_default_chip, buffer, BOOTLOADER_OFFSET + index, toRead);
      if (err != ESP_OK) {
        Serial.printf("[BootloaderStream] Error at 0x%08X: %s\n", BOOTLOADER_OFFSET + index, esp_err_to_name(err));
        return 0;
      }
      return toRead;
    });
  response->addHeader("Content-Disposition", "attachment; filename=bootloader.bin");
  Serial.println("[ESP32FirmwareDownloader] Streaming bootloader...");
  request->send(response);
}

void ESP32FirmwareDownloader::handleActivatePartition(AsyncWebServerRequest *request) {
  Serial.println("[ESP32FirmwareDownloader] Activate partition request received.");
  const esp_partition_t* current = esp_ota_get_running_partition();
  const esp_partition_t* target = nullptr;
  
  if (request->hasParam("label")) {
    String label = request->getParam("label")->value();
    target = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, label.c_str());
    if (!target) {
      request->send(404, "text/plain", "Specified partition not found");
      return;
    }
    if (target->address == current->address) {
      request->send(400, "text/plain", "Specified partition is already running");
      return;
    }
  } else {
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, NULL);
    while (it != NULL) {
      const esp_partition_t* p = esp_partition_get(it);
      if (p && (p->address != current->address)) {
        target = p;
        break;
      }
      it = esp_partition_next(it);
    }
    if (!target) {
      request->send(500, "text/plain", "Inactive partition not found");
      return;
    }
  }
  
