chadalvarez/ESP32FirmwareDL/src/ESP32FirmwareDownloader.cpp
  if (!isPartitionValid(target)) {
    request->send(400, "text/plain", "Partition appears empty/unavailable");
    return;
  }
  
  esp_err_t err = esp_ota_set_boot_partition(target);
  if (err != ESP_OK) {
    String errMsg = "Failed to set boot partition: ";
    errMsg += esp_err_to_name(err);
    request->send(500, "text/plain", errMsg);
    return;
  }
  
  String msg = "Partition ";
  msg += target->label;
  msg += " activated. Rebooting now...";
  request->send(200, "text/plain", msg);
  Serial.println("[ESP32FirmwareDownloader] Partition activated. Rebooting...");
  delay(2000);
  esp_restart();
}

void ESP32FirmwareDownloader::handleClonePartition(AsyncWebServerRequest *request) {
  Serial.println("[ESP32FirmwareDownloader] Clone partition request received.");
  if (cloneActiveToInactive()) {
    request->send(200, "text/plain", "Clone successful.");
  } else {
    request->send(500, "text/plain", "Clone failed.");
  }
}

void ESP32FirmwareDownloader::handleRoot(AsyncWebServerRequest *request) {
  Serial.println("[ESP32FirmwareDownloader] Sending FWDL root page with device metadata and partition map.");

  const esp_partition_t* running = esp_ota_get_running_partition();
  String chipModel = ESP.getChipModel();
  String chipRevision = String(ESP.getChipRevision());
  float flashMB = ESP.getFlashChipSize() / (1024.0 * 1024.0);
  String cpuFreq = String(ESP.getCpuFreqMHz());

  String htmlHeader = R"rawliteral(
<html>
  <head>
    <title>ESP32 Firmware Download (FWDL)</title>
    <style>
      body { font-family: Arial, sans-serif; margin: 20px; }
      table { border-collapse: collapse; width: 90%; }
      th, td { border: 1px solid #ccc; padding: 8px; text-align: center; }
      th { background-color: #f2f2f2; }
      .highlight { background-color: #c0ffc0; }
      .nav { margin-top: 20px; }
      .nav a { margin-right: 10px; text-decoration: none; color: blue; }
      .nav a:hover { text-decoration: underline; }
    </style>
    <script>
      document.addEventListener("DOMContentLoaded", function() {
        var table = document.querySelector("table");
        if (table) {
          table.addEventListener("mouseover", function(e) {
            var target = e.target;
            if (target && target.hasAttribute("data-index")) {
              var idx = target.getAttribute("data-index");
              var row = target.closest("tr");
              if (row) {
                var cells = row.querySelectorAll('[data-index="' + idx + '"]');
                cells.forEach(function(cell) { cell.classList.add("highlight"); });
              }
            }
          });
          table.addEventListener("mouseout", function(e) {
            var target = e.target;
            if (target && target.hasAttribute("data-index")) {
              var idx = target.getAttribute("data-index");
              var row = target.closest("tr");
              if (row) {
                var cells = row.querySelectorAll('[data-index="' + idx + '"]');
                cells.forEach(function(cell) { cell.classList.remove("highlight"); });
              }
            }
          });
        }
      });
    </script>
  </head>
  <body>
    <h1>ESP32 Firmware Download (FWDL)</h1>
    <h2>Device Information</h2>
    <ul>
      <li>Chip Model: )rawliteral" + chipModel + R"rawliteral(</li>
      <li>Chip Revision: )rawliteral" + chipRevision + R"rawliteral(</li>
      <li>Flash Size: )rawliteral" + String(flashMB, 2) + R"rawliteral( MB</li>
      <li>CPU Frequency: )rawliteral" + cpuFreq + R"rawliteral( MHz</li>
    </ul>
    <h2>Partition Map</h2>
    <table>
      <tr>
        <th>Type</th>
        <th>Label</th>
        <th>Address</th>
        <th>Size (bytes)</th>
        <th>Download</th>
        <th>Activate</th>
        <th>Upload</th>
      </tr>
)rawliteral";

  String rows = "";
  esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, NULL);
  while (it != NULL) {
    const esp_partition_t* p = esp_partition_get(it);
    bool isRunning = (running && (p->address == running->address));
    String rowStyle = isRunning ? " style=\"background-color:yellow;\"" : "";
    String displayLabel = String(p->label);
    if (isRunning) displayLabel += " (running)";
    char addrStr[20];
    sprintf(addrStr, "0x%08X", p->address);

    rows += "<tr" + rowStyle + ">";
    rows += "<td>APP</td>";
    rows += "<td>" + displayLabel + "</td>";
    rows += "<td>" + String(addrStr) + "</td>";
    rows += "<td>" + String(p->size) + "</td>";
    rows += "<td><a href=\"/downloaddirect?label=" + String(p->label) + "\">Download</a></td>";
    if (!isRunning) {
      if (isPartitionValid(p)) {
        rows += "<td><button onclick=\"location.href='/activate?label=" + String(p->label) + "'\">Activate</button></td>";
      } else {
        rows += "<td><button disabled title=\"Partition unavailable\">Activate</button></td>";
      }
      rows += "<td><form method='POST' action='/upload' enctype='multipart/form-data' style='display:inline;'>"
              "<input type='hidden' name='label' value='" + String(p->label) + "'>"
              "<input type='file' name='file' style='width:150px;' onchange='checkAppImage(this, " + String(p->size) + ")'>"
              "<input type='submit' value='Upload'>"
              "</form></td>";
    } else {
      rows += "<td>N/A</td><td>N/A</td>";
    }
    rows += "</tr>";
    it = esp_partition_next(it);
  }

  it = esp_partition_find(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, NULL);
  while (it != NULL) {
    const esp_partition_t* p = esp_partition_get(it);
    char addrStr[20];
    sprintf(addrStr, "0x%08X", p->address);
    rows += "<tr>";
    rows += "<td>DATA</td>";
    rows += "<td>" + String(p->label) + "</td>";
    rows += "<td>" + String(addrStr) + "</td>";
    rows += "<td>" + String(p->size) + "</td>";
    rows += "<td><a href=\"/downloaddirect?label=" + String(p->label) + "\">Download</a></td>";
    rows += "<td>N/A</td>";
    rows += "<td><form method='POST' action='/upload' enctype='multipart/form-data' style='display:inline;'>"
            "<input type='hidden' name='label' value='" + String(p->label) + "'>"
            "<input type='file' name='file' style='width:150px;' onchange='checkFileSize(this, " + String(p->size) + ")'>"
            "<input type='submit' value='Upload'>"
            "</form></td>";
    rows += "</tr>";
    it = esp_partition_next(it);
  }

  String htmlFooter = R"rawliteral(
    </table>
    <h2>Global Download Links</h2>
    <ul>
      <li><a href="/dumpflash">Full Flash Dump</a></li>
      <li><a href="/dumpflash_secure">Secure Full Flash Dump</a></li>
      <li><a href="/downloadboot">Bootloader Download</a></li>
      <li><a href="/clone">Clone Active APP Partition</a></li>
      <li>Generic Download: /downloaddirect?label=YourPartitionLabel</li>
    </ul>
  </body>
</html>
)rawliteral";

