chadalvarez/ESP32FirmwareDL/src/ESP32FirmwareDownloader.cpp
  String fullHtml = htmlHeader + rows + htmlFooter;
  request->send(200, "text/html", fullHtml);
}

//////////////////////////////
// Upload Handler
//////////////////////////////
void ESP32FirmwareDownloader::handleUploadBinary(AsyncWebServerRequest *request,
    const String &filename, size_t index, uint8_t *data, size_t len, bool final) {
  // Retrieve target partition label.
  String label = "";
  if (request->hasParam("label", true)) {
    label = request->getParam("label", true)->value();
  } else {
    Serial.println("[Upload] Missing 'label' parameter");
    request->send(400, "text/plain", "Missing 'label' parameter");
    return;
  }

  // Try to find APP partition first.
  const esp_partition_t* target = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, label.c_str());
  // Static variables for APP OTA update.
  static esp_ota_handle_t ota_handle = 0;
  static bool otaStarted = false;
  
  // For DATA partitions.
  static bool dataUpdateStarted = false;
  static uint32_t dataOffset = 0;

  if (!target) {
    target = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, label.c_str());
    if (!target) {
      Serial.printf("[Upload] Target partition '%s' not found!\n", label.c_str());
      request->send(404, "text/plain", "Target partition not found");
      return;
    }
    if (index == 0) {
      dataUpdateStarted = true;
      dataOffset = 0;
      Serial.printf("[Upload] Erasing DATA partition '%s' (size: %u bytes)...\n", label.c_str(), target->size);
      esp_err_t err = esp_partition_erase_range(target, 0, target->size);
      if (err != ESP_OK) {
        Serial.printf("[Upload] Erase failed: %s\n", esp_err_to_name(err));
        request->send(500, "text/plain", "Erase partition failed");
        dataUpdateStarted = false;
        return;
      }
    }
    esp_err_t err = esp_partition_write(target, dataOffset, data, len);
    if (err != ESP_OK) {
      Serial.printf("[Upload] esp_partition_write failed at offset %u: %s\n", dataOffset, esp_err_to_name(err));
      return;
    }
    dataOffset += len;
    if (final) {
      Serial.printf("[Upload] DATA partition '%s' update complete.\n", label.c_str());
      request->send(200, "text/plain", "Upload complete for DATA partition");
      dataUpdateStarted = false;
    }
    return;
  }
  
  // For APP partitions, disallow updating the active partition.
  const esp_partition_t* running = esp_ota_get_running_partition();
  if (running && target->address == running->address) {
    Serial.printf("[Upload] Cannot update active partition '%s'.\n", label.c_str());
    request->send(400, "text/plain", "Cannot update active partition");
    return;
  }
  
  // APP OTA update.
  if (index == 0) {
    if (otaStarted) {
      Serial.println("[Upload] OTA update already started, ignoring new start.");
      return;
    }
    otaStarted = true;
    Serial.printf("[Upload] Beginning OTA update for partition '%s' (size: %u bytes)...\n", label.c_str(), target->size);
    esp_err_t err = esp_ota_begin(target, target->size, &ota_handle);
    if (err != ESP_OK) {
      Serial.printf("[Upload] esp_ota_begin failed: %s\n", esp_err_to_name(err));
      ota_handle = 0;
      otaStarted = false;
      request->send(500, "text/plain", "OTA update failed to begin");
      return;
    }
  }
  
  if (ota_handle == 0) {
    Serial.println("[Upload] OTA handle not available.");
    return;
  }
  
  esp_err_t err = esp_ota_write(ota_handle, data, len);
  if (err != ESP_OK) {
    Serial.printf("[Upload] esp_ota_write failed at index %u: %s\n", index, esp_err_to_name(err));
    return;
  }
  
  if (final) {
    Serial.println("[Upload] Finalizing OTA update...");
    err = esp_ota_end(ota_handle);
    if (err != ESP_OK) {
      Serial.printf("[Upload] esp_ota_end failed: %s\n", esp_err_to_name(err));
      return;
    }
    err = esp_ota_set_boot_partition(target);
    if (err != ESP_OK) {
      Serial.printf("[Upload] esp_ota_set_boot_partition failed: %s\n", esp_err_to_name(err));
      return;
    }
    Serial.println("[Upload] OTA update complete. Rebooting...");
    request->send(200, "text/plain", "Upload complete, device will reboot");
    ota_handle = 0;
    otaStarted = false;
    delay(2000);
    esp_restart();
  }
}

////////////////////////////
// attach() and attachAll()
////////////////////////////
bool ESP32FirmwareDownloader::attach(AsyncWebServer &server, bool eraseUserData) {
  if (eraseUserData) {
    if (autoSetUserDataBlankAll()) {
      Serial.println("[ESP32FirmwareDownloader] User data partitions detected for secure dump.");
    } else {
      Serial.println("[ESP32FirmwareDownloader] No additional user data partitions found.");
    }
  }
  server.on(_endpoint, HTTP_GET, handleDumpFlash);
  return true;
}

bool ESP32FirmwareDownloader::attachAll(AsyncWebServer &server, bool eraseUserData) {
  bool ok = true;
  ok &= attach(server, eraseUserData);
  server.on("/downloadboot", HTTP_GET, handleDownloadBoot);
  server.on("/downloaddirect", HTTP_GET, handleDownloadPartitionDirect);
  server.on("/activate", HTTP_GET, handleActivatePartition);
  server.on("/clone", HTTP_GET, handleClonePartition);
  server.on("/FWDL", HTTP_GET, handleRoot);
  server.on("/dumpflash_secure", HTTP_GET, handleDumpFlashSecure);
  server.on("/upload", HTTP_POST,
    [](AsyncWebServerRequest *request) {
      request->send(200, "text/plain", "Upload complete");
    },
    handleUploadBinary
  );
  return ok;
}
